demos/helpdesk/src/test/resources/xml/soap-request.xml

<?xml version="1.0" encoding="UTF-8"?>
<soap:Envelope
    xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/"
    xmlns:bpm="urn:switchyard-component-bpm:process:1.0"
    xmlns:helpdesk="urn:switchyard-quickstart-demo:helpdesk:1.0">
    <soap:Header>
        <bpm:processActionType>startProcess</bpm:processActionType>
    </soap:Header>
    <soap:Body>
        <helpdesk:openTicket>
            <ticket>
                <id>TCKT-17761852</id>
            </ticket>
        </helpdesk:openTicket>
    </soap:Body>
</soap:Envelope>
